app/views/rounds/show_part_b.html.erb

<script type='text/javascript'>
$(document).ready(function() {
    var credits = 150
    $('#credits').text(credits)
	 <% number_of_projects = @current_round.projects.count %>

	<% @current_round.projects.each_with_index do |project, i| %>
    	<%= "$('#contribution_#{i}').keyup(function()" %> {
    		var remaining_credits = (credits<% number_of_projects.times do |i| %> - <%= "$('#contribution_#{i}').val()" %><% end %>)
       	$('#credits').text(remaining_credits);
	       if(remaining_credits < 0)
	       {
		        $('#credits').css("color", "red");
	       }
	       else
	       {
		        $('#credits').css("color", "black");
	       }
   	});
---
SELECT COUNT(*) FROM `projects` WHERE `projects`.`round_id` = 1911
SELECT `projects`.* FROM `projects` WHERE `projects`.`round_id` = 1911