app/views/rounds/summary.html.erb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 7673 LIMIT 1
---
			<font color="#B94A48">
			<%= " + #{@contributions.where(:project_id => @current_round.projects[0]).first.amount}" unless @current_round.projects[0].funded?%>