app/views/projects/_stats.html.erb


<% @current_round.projects.each do |project| %>
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`round_id` = 1910