app/views/experiments/users.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`experiment_id` = 54
---
<tbody>
<% @experiment.users.each do |u| %>