app/controllers/contributions_controller.rb

  def submit      # <TODO CL> Refactor and move into model.
    @current_round = Round.find(params[:current_round_id])
    @user = current_user
    @preference = DonorPreference.where(:user_id => @user, :round_id => @current_round).first
    @current_group = @preference.group

    @total_amount_contributed = 0
    @current_group.projects.each_with_index do |project, i|
      @amount_contributed = params["amount_#{i}".to_sym].to_i
      @total_amount_contributed += @amount_contributed
    end

    if @preference.credits_not_donated.blank?
      @user_donate_amount = AMOUNT_DONOR_CAN_DONATE_PER_ROUND
    else
      @user_donate_amount = @preference.credits_not_donated
    end

    if @total_amount_contributed > @user_donate_amount
      redirect_to round_show_part_b_path(@current_round), :alert => "Total amount contributed cannot exceed: #{@user_donate_amount} credits!" and return
    else
      @current_group.projects.each_with_index do |project, i|
        break if @project_id == 0
        @project_id = params["project_id_#{i}".to_sym].to_i
        @project = Project.find(@project_id)
        @amount_contributed = params["amount_#{i}".to_sym].to_i

        if @amount_contributed > 0
          unless @project.create_contribution(@user, @amount_contributed)
---
SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`id` = 1911 LIMIT 1
SELECT `donor_preferences`.* FROM `donor_preferences` WHERE `donor_preferences`.`user_id` = 573 AND `donor_preferences`.`round_id` = 1911 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 7675 LIMIT 1
INSERT INTO `contributions` (`amount`, `created_at`, `project_id`, `round_id`, `time_contributed`, `updated_at`, `user_id`) VALUES (324, '2013-06-03 03:30:11', 7675, 1911, NULL, '2013-06-03 03:30:11', 573)