app/controllers/experiments_controller.rb

SELECT `experiments`.* FROM `experiments` WHERE `experiments`.`id` = 54 LIMIT 1
---
	def users
		@experiment = Experiment.find(params[:id])

SELECT `experiments`.* FROM `experiments` WHERE `experiments`.`id` = 54 LIMIT 1
SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`group_id` = 107 AND (`rounds`.`number` BETWEEN 1 AND 3) ORDER BY number DESC LIMIT 1
SELECT `groups`.* FROM `groups` WHERE `groups`.`experiment_id` = 54 ORDER BY `groups`.`id` DESC LIMIT 1
---
	def dashboard
		require_admin
		@experiment = Experiment.find(params[:id])
		@roundsA = @experiment.groups.first.rounds.where(:number => (1..@experiment.current_round_number)).order("number DESC")
		@roundsB = @experiment.groups.last.rounds.where(:number => (1..@experiment.current_round_number)).order("number DESC")

		if @roundsA.first.finished and @roundsB.first.finished

SELECT `experiments`.* FROM `experiments`
---
	def index
		require_admin
		@experiments = Experiment.all