app/controllers/projects_controller.rb

SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`id` = 1911 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 572 LIMIT 1
SELECT `creator_preferences`.* FROM `creator_preferences` WHERE `creator_preferences`.`user_id` = 572 AND `creator_preferences`.`round_id` = 1911 LIMIT 1
UPDATE `projects` SET `round_id` = 1911, `value` = 'Low', `goal_amount` = 400, `funded_amount` = 0, `created_at` = '2013-06-03 03:27:06', `updated_at` = '2013-06-03 03:27:06', `name` = 'Pink Sherbet' WHERE `projects`.`id` = 7675
INSERT INTO `projects` (`admin_name`, `created_at`, `funded_amount`, `goal_amount`, `group`, `name`, `round_id`, `start_amount`, `updated_at`, `value`) VALUES (NULL, '2013-06-03 03:27:06', 0, 400, NULL, NULL, 1911, NULL, '2013-06-03 03:27:06', 'Low')
---
  def create_projects                  # <TODO CL> Refactor and Move into Model.
    @current_round = Round.find(params[:id])
    if current_admin_user.present?
      @user = @current_round.experiment.users.where("user_type = ?", "Creator").first
    else
      @user = current_user
    end
    @experiment = @user.experiment
    @number_of_projects = 3

    @preferences = CreatorPreference.where(:user_id => @user, :round_id => @current_round)
    @preferences.each do |preference|
      current_group = preference.group

      if preference.finished_round == false
        Group.transaction do
          3.times do |itr|
            @new_project = Project.new
            @new_project.update_attributes(:user_id => @user.id,
              :group_id => current_group.id, :name => generate_project_name,
              :value => ["High", "Low"].sample, :popularity => ["Popular", "Niche"].sample
            )
            current_group.projects << @new_project