app/controllers/projects_controller.rb

UPDATE `creator_preferences` SET `finished_round` = 1, `updated_at` = '2013-06-03 03:27:06' WHERE `creator_preferences`.`id` = 742
---
  def create_projects
		@current_round = Round.find(params[:id])
    @user = current_user
    @preference = CreatorPreference.where(:user_id => @user, :round_id => @current_round).first

    if @preference.finished_round == false
      if params[:project1Value]
        @current_round.projects << Project.new(:round => @current_round, :value => params[:project1Value])
      end
      if params[:project2Value]
        @current_round.projects << Project.new(:round => @current_round, :value => params[:project2Value])
      end
      @preference.finished_round = true
      @preference.save!