app/controllers/rounds_controller.rb

	def waiting_for_round
		@current_round = Round.find(params[:id])
		@pref = Preferences.where(:user_id => current_user.id, :round_id => @current_round.id).first if @pref.nil?
		@pref.ready_save_and_check_round unless @pref.ready_to_start

		if @current_round.started
			current_experiment.start_experiment unless current_experiment.started
			current_experiment.current_round_number = @current_round.number
			current_experiment.save!
---
UPDATE `experiments` SET `current_round_number` = 3, `updated_at` = '2013-06-01 02:08:05' WHERE `experiments`.`id` = 54