app/controllers/rounds_controller.rb

SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`id` = 1910 LIMIT 1
SELECT `creator_preferences`.* FROM `creator_preferences` WHERE `creator_preferences`.`user_id` = 572 AND `creator_preferences`.`round_id` = 1910 LIMIT 1
SELECT `donor_preferences`.* FROM `donor_preferences` WHERE `donor_preferences`.`user_id` = 573 AND `donor_preferences`.`round_id` = 1911 LIMIT 1
---
	def waiting_for_round
	  @experiment = current_experiment
		@current_round = Round.find(params[:id])
    @user = current_user
    unless @user.group_id == @current_round.group_id
      @user.group_id = @current_round.group_id
      @user.save!
    end

		if @user.user_type == "Creator"
		  @preference = CreatorPreference.where(:user_id => @user, :round_id => @current_round).first
		elsif @user.user_type == "Donor"
      @preference = DonorPreference.where(:user_id => @user, :round_id => @current_round.id).first

SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`id` = 1910 LIMIT 1
SELECT `creator_preferences`.* FROM `creator_preferences` WHERE `creator_preferences`.`user_id` = 572 AND `creator_preferences`.`round_id` = 1911 LIMIT 1
---
	def show_part_a
		@current_round = Round.find(params[:id])
		@user = current_user
		check_round(@current_round, @user)

		if @current_round.part_b_started
      redirect_to waiting_for_part_b_path(@current_round)
		elsif @user.user_type == "Creator"
		  @preference = CreatorPreference.where(:user_id => @user, :round_id => @current_round).first

SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`id` = 1911 LIMIT 1
---
	def show_part_a_2
		@current_round = Round.find(params[:id])

SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`id` = 1910 LIMIT 1
---
	def waiting_for_part_b
		@current_round = Round.find(params[:id])

SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`id` = 1910 LIMIT 1
SELECT `donor_preferences`.* FROM `donor_preferences` WHERE `donor_preferences`.`user_id` = 573 AND `donor_preferences`.`round_id` = 1911 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`round_id` = 1911
---
	def show_part_b
	  @current_round = Round.find(params[:id])
		@user = current_user

    if @current_round.part_b_finished
      redirect_to summary_waiting_path(@current_round)
    elsif @user.user_type == "Donor"
      @preference = DonorPreference.where(:user_id => @user, :round_id => @current_round.id).first
  		@projects = Project.where(:round_id => @current_round.id)

SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`id` = 1910 LIMIT 1
---
	def waiting_for_summary
		@current_round = Round.find(params[:id])

SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`id` = 1910 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`round_id` = 1910
SELECT `contributions`.* FROM `contributions` WHERE `contributions`.`project_id` = 7673
SELECT `rounds`.* FROM `rounds` INNER JOIN `groups` ON `rounds`.`group_id` = `groups`.`id` WHERE `groups`.`experiment_id` = 54 AND `rounds`.`group_id` = 107 AND `rounds`.`number` = 3 LIMIT 1
---
	def summary
		@current_round = Round.find(params[:id])
		@user = current_user
		@current_experiment = current_experiment
		@projects = @current_round.projects

		@contributions = []
		@projects.each do |project|
		  project.contributions.each do |contribution|
		    @contributions << contribution
		  end
		end

		@next_round_number = @current_round.number + 1
		@next_round = @current_experiment.rounds.where(:group_id => @current_round.group_id, :number => @next_round_number).first