app/controllers/rounds_controller.rb

	def waiting_for_round
		@current_round = Round.find(params[:id])
    @experiment = @current_round.experiment

    if current_admin_user.present?
      @user = @current_round.experiment.users.where("user_type = ?", "Creator").first
---
SELECT `experiments`.* FROM `experiments` WHERE `experiments`.`id` = 54 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 572 LIMIT 1

	def show_part_b
	  @current_round = Round.find(params[:id])
    if current_admin_user.present?
      @user = @current_round.experiment.users.where("user_type = ?", "Creator").first
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 572 LIMIT 1

	def waiting_for_summary
    @current_round = Round.find(params[:id])
    @time_remaining = @current_round.remaining_seconds
    if current_admin_user.present?
      @user = @current_round.experiment.users.where("user_type = ?", "Creator").first
    else
      @user = current_user
    end

		@experiment = @current_round.experiment
		@group = Group.where(:round_id => @current_round)

    set_user_status(@user, "Waiting for Round ##{@current_round.number} Summary")

    if @time_remaining == 0
      @current_round.set_finished_round
    end

    if @current_round.check_if_round_complete
      Group.where(:round_id => @current_round).each do |group|
        group.projects.each do |project|
          project.calculate_funding_details
        end
      end

      CreatorPreference.where(:round_id => @current_round).each do |preference|
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 572 LIMIT 1
SELECT `creator_preferences`.* FROM `creator_preferences` WHERE `creator_preferences`.`round_id` = 1910