app/controllers/users_controller.rb

	def instructions
		@user = current_user

		if !current_experiment.started
			current_experiment.start_time = DateTime.now
			current_experiment.save!
		end

		@user.times_viewed_instructions = current_user.times_viewed_instructions + 1
		@user.save!

		@current_round = Group.find(@user.group_id).rounds.where(:number => current_experiment.current_round_number).first
		# @first_round = Group.find(@user.group_id).rounds.first
		@temp_rounds = current_experiment.rounds.where(:number => 1)
		@first_round = nil
		if @user.preferences.where(:round_id => @temp_rounds.first.id).first.nil?
---
UPDATE `users` SET `times_viewed_instructions` = 4, `updated_at` = '2013-06-01 02:07:29' WHERE `users`.`id` = 572
SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`group_id` = 107 AND `rounds`.`number` = 1 LIMIT 1
SELECT `rounds`.* FROM `rounds` WHERE `rounds`.`group_id` = 107